# STEP 0. Pandas 라이브러리 불러오기

* Pandas 라이브러리를 설치한다.(파이썬 기본(내장)모듈이 아니라 개발자들이 만든 외부모듈이기에 설치를 해야 사용 가능.)
        pip install pandas
* Pandas 라이브러리를 불러오고, 별칭을 pd로 정한다.
* 별칭은 사용자 마음대로 정할 수 있으나 일반적으로는 해당 모듈명의 축약형을 사용한다. (P)an(d)as -> pd
        import pandas as pd
* 별칭 작성 문법은 아래와 같다.
        1. import (모듈명) as (별칭)
        2. from (패키지명) import (모듈명) as (별칭)

In [ ]:
# Google Colab의 경우 Pandas가 기본으로 설치되어있어 설치 없이 불러오기만 한다.
import pandas as pd

# STEP 1. Pandas의 자료구조 Series

* Pandas의 자료구조 중 하나인 Series를 다뤄본다.
* ※ Series는 행렬(2차원 구조)로 출력이 되지만 인덱스와 값으로 이루어져 있는 1행 구조임을 기억해야 한다.

## 1-1. Series 다루기 예제

< 예시 자료 >    
*    편의점별 바나나우유 가격정보를 통해 시리즈 데이터를 만들어보자.
    *    ※ 해당 가격은 임의로 정한 내용으로 실제와 다를 수 있습니다.
*    편의점 내역 : DU, GS27, 세분일레븐, 아이마트24, 빅스톱
*    편의점별 바나나우유 가격 정보
    *    DU         : 1,200원
    *    GS27       : 1,400원
    *    세분일레븐 : 1,100원
    *    아이마트24 : 1,300원
    *    빅스톱     : 1,000원

In [ ]:
### < Dictionary로 Pandas Series 만들기 > ###
# 바나나우유 정보 Dictionary
bmilk_dict = {'DU':1200, 'GS27':1400, '세분일레븐':1100, '아이마트24':1300, '빅스톱':1000}

# 바나나우유 Series 만들기
bmilk_data1 = pd.Series(bmilk_dict)
print('bmilk_data1 Type :', type(bmilk_data1))
bmilk_data1

bmilk_data1 Type : <class 'pandas.core.series.Series'>

DU        1200
GS27      1400
세분일레븐     1100
아이마트24    1300
빅스톱       1000
dtype: int64

In [ ]:
# bmilk_data1 Index
bmilk1_idx = bmilk_data1.index
bmilk1_idx

Index(['DU', 'GS27', '세분일레븐', '아이마트24', '빅스톱'], dtype='object')

In [ ]:
# bmilk_data1 Value
bmilk1_val = bmilk_data1.values
bmilk1_val

array([1200, 1400, 1100, 1300, 1000])

In [ ]:
## < Series에서 요소 선택하기> ##
# Series에서 0번 인덱스 값 선택
bmilk_data1[0]

1200

In [ ]:
# Series에서 1번 인덱스에서 3번 인덱스 앞(2번 인덱스)까지 슬라이싱
bmilk_data1[1:3]

GS27     1400
세분일레븐    1100
dtype: int64

In [ ]:
# Series에서 인덱스명이 '빅스톱'인 값 선택
bmilk_data1['빅스톱']

1000

In [ ]:
# Series에서 인덱스명이 'DU', '세분일레븐'인 값을 새로운 Series로 반환
bmilk_data1[['DU', '세분일레븐']]

DU       1200
세분일레븐    1100
dtype: int64

In [ ]:
### < List로 Pandas Series 만들기 > ###
# 바나나우유 가격정보 List
bmilk_list = [1200, 1400, 1100, 1300, 1000]

# 바나나우유 Series 만들기(index에 각 가격에 맞는 편의점명을 넣는다.)
bmilk_data2 = pd.Series(bmilk_list, index=['DU', 'GS27', '세분일레븐', '아이마트24', '빅스톱'])
print('bmilk_data2 Type :', type(bmilk_data2))
bmilk_data2

bmilk_data2 Type : <class 'pandas.core.series.Series'>

DU        1200
GS27      1400
세분일레븐     1100
아이마트24    1300
빅스톱       1000
dtype: int64

In [ ]:
# bmilk_data2 Index
bmilk2_idx = bmilk_data2.index
bmilk2_idx

Index(['DU', 'GS27', '세분일레븐', '아이마트24', '빅스톱'], dtype='object')

In [ ]:
# bmilk_data2 Value
bmilk2_val = bmilk_data2.values
bmilk2_val

array([1200, 1400, 1100, 1300, 1000])

In [ ]:
## < Series에서 요소 선택하기> ##
# Series에서 0번 인덱스 값 선택
bmilk_data2[0]

1200

In [ ]:
# Series에서 1번 인덱스에서 3번 인덱스 앞(2번 인덱스)까지 슬라이싱
bmilk_data2[1:3]

GS27     1400
세분일레븐    1100
dtype: int64

In [ ]:
# Series에서 인덱스명이 '빅스톱'인 값 선택
bmilk_data2['빅스톱']

1000

In [ ]:
# Series에서 인덱스명이 'DU', '세분일레븐'인 값을 새로운 Series로 반환
bmilk_data2[['DU', '세분일레븐']]

DU       1200
세분일레븐    1100
dtype: int64

## 1-2. Series 다루기 실습

< 실습 자료 >    
*    편의점별 김밥 가격정보를 통해 시리즈 데이터를 만들어보자.
    *    ※ 해당 가격은 임의로 정한 내용으로 실제와 다를 수 있습니다.
*    편의점 내역 : DU, GS27, 세분일레븐, 아이마트24, 빅스톱
*    편의점별 김밥 가격 정보
    *    DU         : 1,600원
    *    GS27       : 1,800원
    *    세분일레븐 : 1,700원
    *    아이마트24 : 1,900원
    *    빅스톱     : 2,000원

< 조건 >
1.    Series를 만들 때, 어떤 방식을 사용해도 무관
    *    Dictionary 형식, List 형식 등 자유롭게 사용
2.    Series의 인덱스 순서는 GS27, 세분일레븐, 빅스톱, DU, 아이마트24 순으로 만들 것.
    *    ※ 순서 반드시 잘 지킬 것!!!
3.    변수명은 자유롭게 정해도 괜찮으나 누구나 이해할 수 있도록 작성
    *    변수는 명사로 작성하는 것이 좋음

< 문제 >
1.    편의점별 김밥 가격 Series를 만드시오.
2.    편의점별 김밥 Series의 3번 인덱스의 가격을 출력하시오.
3.    편의점별 김밥 Series의 3번 인덱스에서 5번 인덱스까지 슬라이싱 후 출력하시오.
4.    DU 편의점 김밥 가격은 얼마인지 편의점명을 사용해서 출력하시오.
5.    GS27, 빅스톱, 아이마트24의 김밥 가격을 하나의 Series로 출력하시오.

In [ ]:
# 문제 1. 편의점별 김밥 가격 Series를 만드시오.
# 코드 작성
kimbob_dict = {'DU':1600, 'GS27':1800, '세분일레븐':1700, '아이마트24':1900, '빅스톱':2000}

kimbob_data1 = pd.Series(kimbob_dict)
print(type(kimbob_data1))
kimbob_data1

<class 'pandas.core.series.Series'>

DU        1600
GS27      1800
세분일레븐     1700
아이마트24    1900
빅스톱       2000
dtype: int64

In [ ]:
# 문제 2. 편의점별 김밥 Series의 3번 인덱스의 가격을 출력하시오.
# 코드 작성
kimbob_data1[3]

1900

In [ ]:
# 문제 3. 편의점별 김밥 Series의 3번 인덱스에서 5번 인덱스까지 슬라이싱 후 출력하시오.
# 코드 작성
kimbob_data1[3:6]

아이마트24    1900
빅스톱       2000
dtype: int64

In [ ]:
# 문제 4. DU 편의점 김밥 가격은 얼마인지 편의점명을 사용해서 출력하시오.
# 코드 작성
kimbob_data1['DU']

1600

In [ ]:
# 문제 5. GS27, 빅스톱, 아이마트24의 김밥 가격을 하나의 Series로 출력하시오.
# 코드 작성
kimbob_data1[['GS27', '빅스톱', '아이마트24']]

GS27      1800
빅스톱       2000
아이마트24    1900
dtype: int64

# STEP 2. Pandas의 자료구조 DataFrame

* Pandas의 자료구조 중 하나인 DataFrame을 다뤄본다.
* ※ DataFrame은 행(Index)과 열(Column)로 이루어져 있는 2차원 구조임을 기억해야 한다.

< 예시 자료 >    
*    기업별 연봉, 채용직무를 통해 데이터프레임을 만들어보자.
    *    ※ 해당 정보는 실제와 다를 수 있습니다.
*    기업 종류 : 네이버, 카카오, 삼성전자, 넥슨코리아, 쿠팡
*    기업별 연봉 정보
    *    네이버     : 4,500만원
    *    카카오     : 4,200만원
    *    삼성전자   : 4,000만원
    *    넥슨코리아 : 3,600만원
    *    쿠팡       : 4,000만원
*    기업별 채용직무
    *    네이버     : 데이터분석
    *    카카오     : IT개발
    *    삼성전자   : 경영사무
    *    넥슨코리아 : 게임기획
    *    쿠팡       : 마케팅

## 2-1. DataFrame 다루기 예제

In [ ]:
### < List로 Pandas DataFrame 만들기 > ###
# List로 만드는 경우, 리스트 안에 리스트가 요소로 들어가있으며,
# 내부에 있는 리스트 하나가 한 행의 데이터가 된다.
# DataFrame의 index와 column을 직접 지정하는 경우 리스트 형태로 넣어야 하며,
# 지정하지 않는 경우 기본값은 데이터 수에 맞는 정수형으로 입력된다.(0부터 시작)

comp_list = [['네이버', '4,500만원', '데이터분석'], ['카카오', '4,200만원', 'IT개발'],
             ['삼성전자', '4,000만원', '경영사무'], ['넥슨코리아', '3,600만원', '게임기획'],
             ['쿠팡', '4,000만원', '마케팅']]
comp_df1 = pd.DataFrame(comp_list, index=[0,1,2,3,4], columns=['기업명', '연봉', '채용직무'])
comp_df1

     기업명       연봉   채용직무
0    네이버  4,500만원  데이터분석
1    카카오  4,200만원   IT개발
2   삼성전자  4,000만원   경영사무
3  넥슨코리아  3,600만원   게임기획
4     쿠팡  4,000만원    마케팅

In [ ]:
### < Dictionary로 Pandas DataFrame 만들기 > ###
# Dictionary로 만드는 경우, key에는 DataFrame의 column으로 사용할 값을 넣고,
# value에는 key로 넣은 column과 관련된 값을 리스트로 넣는다.
# DataFrame의 index는 지정할 수 있으며, 지정하지 않는 경우 기본값은 데이터 수에 맞는 정수형이다.(0부터 시작)

comp_dict = {'기업명':['네이버', '카카오', '삼성전자', '넥슨코리아', '쿠팡'],
             '연봉':['4,500만원', '4,500만원', '4,500만원', '4,500만원', '4,500만원'],
             '채용직무':['데이터분석', 'IT개발', '경영사무', '게임기획', '마케팅']}
comp_df2 = pd.DataFrame(comp_dict, index=[0,1,2,3,4])
comp_df2

     기업명       연봉   채용직무
0    네이버  4,500만원  데이터분석
1    카카오  4,500만원   IT개발
2   삼성전자  4,500만원   경영사무
3  넥슨코리아  4,500만원   게임기획
4     쿠팡  4,500만원    마케팅

In [ ]:
# 데이터프레임 변수
print('데이터프레임 index :', comp_df1.index)
print('데이터프레임 columns :', comp_df1.columns)

데이터프레임 index : Int64Index([0, 1, 2, 3, 4], dtype='int64')
데이터프레임 columns : Index(['기업명', '연봉', '채용직무'], dtype='object')

In [ ]:
# 인덱스(행), 컬럼(열) 이름 바꾸기 1
print('======= 변경 전 =======')
comp_df1

======= 변경 전 =======

     기업명       연봉   채용직무
0    네이버  4,500만원  데이터분석
1    카카오  4,200만원   IT개발
2   삼성전자  4,000만원   경영사무
3  넥슨코리아  3,600만원   게임기획
4     쿠팡  4,000만원    마케팅

In [ ]:
print('======= 변경 후 =======')
comp_df1.index = ['Naver', 'Kakao', 'Samsung', 'Nexon', 'Coupang']
comp_df1.columns = ['기업명(한글)', '신입초봉', '채용직군']
comp_df1

======= 변경 후 =======

        기업명(한글)     신입초봉   채용직군
Naver       네이버  4,500만원  데이터분석
Kakao       카카오  4,200만원   IT개발
Samsung    삼성전자  4,000만원   경영사무
Nexon     넥슨코리아  3,600만원   게임기획
Coupang      쿠팡  4,000만원    마케팅

In [ ]:
# 인덱스(행), 컬럼(열) 이름 바꾸기 2
print('======= 변경 전 =======')
comp_df1

======= 변경 전 =======

        기업명(한글)     신입초봉   채용직군
Naver       네이버  4,500만원  데이터분석
Kakao       카카오  4,200만원   IT개발
Samsung    삼성전자  4,000만원   경영사무
Nexon     넥슨코리아  3,600만원   게임기획
Coupang      쿠팡  4,000만원    마케팅

In [ ]:
print('======= 변경 후 =======')
comp_df1.rename(index={'Naver':'N사', 'Kakao':'K사', 'Samsung':'S사', 'Nexon':'Nx사', 'Coupang':'C사'}, inplace=True)
comp_df1.rename(columns={'기업명(한글)':'기업명(국문)', '채용직군':'주업무'}, inplace=True)
comp_df1

======= 변경 후 =======

    기업명(국문)     신입초봉    주업무
N사      네이버  4,500만원  데이터분석
K사      카카오  4,200만원   IT개발
S사     삼성전자  4,000만원   경영사무
Nx사   넥슨코리아  3,600만원   게임기획
C사       쿠팡  4,000만원    마케팅

In [ ]:
## 행/열 삭제
# 행 삭제
print('======= 행 삭제 전 =======')
comp_df1

======= 행 삭제 전 =======

    기업명(국문)     신입초봉    주업무
N사      네이버  4,500만원  데이터분석
K사      카카오  4,200만원   IT개발
S사     삼성전자  4,000만원   경영사무
Nx사   넥슨코리아  3,600만원   게임기획
C사       쿠팡  4,000만원    마케팅

In [ ]:
print('======= 행 삭제 후 =======')
comp_df1.drop('Nx사', axis=0) # 여러 행을 삭제할 경우 ['N사', 'K사']와 같이 리스트 형으로 넣기

======= 행 삭제 후 =======

   기업명(국문)     신입초봉    주업무
N사     네이버  4,500만원  데이터분석
K사     카카오  4,200만원   IT개발
S사    삼성전자  4,000만원   경영사무
C사      쿠팡  4,000만원    마케팅

In [ ]:
# 열 삭제
print('======= 열 삭제 전 =======')
comp_df1

======= 열 삭제 전 =======

    기업명(국문)     신입초봉    주업무
N사      네이버  4,500만원  데이터분석
K사      카카오  4,200만원   IT개발
S사     삼성전자  4,000만원   경영사무
Nx사   넥슨코리아  3,600만원   게임기획
C사       쿠팡  4,000만원    마케팅

In [ ]:
print('======= 열 삭제 후 =======')
comp_df1.drop('기업명(국문)', axis=1) # 여러 열을 삭제할 경우 ['기업명(국문)', '신입초봉']와 같이 리스트 형으로 넣기

======= 열 삭제 후 =======

        신입초봉    주업무
N사   4,500만원  데이터분석
K사   4,200만원   IT개발
S사   4,000만원   경영사무
Nx사  3,600만원   게임기획
C사   4,000만원    마케팅

In [ ]:
# 행 선택 1 (loc를 이용하는 방법)
print('======= 단일 행 선택 =======')
comp_df1.loc['K사']

======= 단일 행 선택 =======

기업명(국문)        카카오
신입초봉       4,200만원
주업무           IT개발
Name: K사, dtype: object

In [ ]:
print('======= 다중 행 선택 =======')
comp_df1.loc[['N사','C사']]

======= 다중 행 선택 =======

   기업명(국문)     신입초봉    주업무
N사     네이버  4,500만원  데이터분석
C사      쿠팡  4,000만원    마케팅

In [ ]:
# 행 선택 2 (iloc를 이용하는 방법)
print('======= 단일 행 선택 =======')
comp_df1.iloc[0]

======= 단일 행 선택 =======

기업명(국문)        네이버
신입초봉       4,500만원
주업무          데이터분석
Name: N사, dtype: object

In [ ]:
print('======= 다중 행 선택 =======')
comp_df1.iloc[0:2]

======= 다중 행 선택 =======

   기업명(국문)     신입초봉    주업무
N사     네이버  4,500만원  데이터분석
K사     카카오  4,200만원   IT개발

In [ ]:
# 열 선택
print('======= 단일 열 선택 =======')
comp_df1['기업명(국문)']

======= 단일 열 선택 =======

N사       네이버
K사       카카오
S사      삼성전자
Nx사    넥슨코리아
C사        쿠팡
Name: 기업명(국문), dtype: object

In [ ]:
print('======= 다중 열 선택 =======')
comp_df1[['기업명(국문)', '주업무']]

======= 다중 열 선택 =======

    기업명(국문)    주업무
N사      네이버  데이터분석
K사      카카오   IT개발
S사     삼성전자   경영사무
Nx사   넥슨코리아   게임기획
C사       쿠팡    마케팅

In [ ]:
## 범위 선택 (행과 열)
# loc 사용 시 : loc[행, 열]
comp_df1.loc['S사', '주업무']

'경영사무'

In [ ]:
# iloc 사용 시 : iloc[행, 열]
comp_df1.iloc[0, 1]

'4,500만원'

In [ ]:
## 행 추가
# loc 사용 시 : loc[사용할 인덱스명] = 데이터
# iloc 사용 시 : iloc[사용할 인덱스번호] = 데이터
comp_df1.loc['L사'] = ['LG전자', '4,400만원', 'R&D']
comp_df1

    기업명(국문)     신입초봉    주업무
N사      네이버  4,500만원  데이터분석
K사      카카오  4,200만원   IT개발
S사     삼성전자  4,000만원   경영사무
Nx사   넥슨코리아  3,600만원   게임기획
C사       쿠팡  4,000만원    마케팅
L사     LG전자  4,400만원    R&D

In [ ]:
## 열 추가
# DataFrame명[사용할 컬럼명] = 데이터
comp_df1['경력요건'] = ['신입', '신입', '경력', '경력', '신입', '경력무관']
comp_df1

    기업명(국문)     신입초봉    주업무  경력요건
N사      네이버  4,500만원  데이터분석    신입
K사      카카오  4,200만원   IT개발    신입
S사     삼성전자  4,000만원   경영사무    경력
Nx사   넥슨코리아  3,600만원   게임기획    경력
C사       쿠팡  4,000만원    마케팅    신입
L사     LG전자  4,400만원    R&D  경력무관

## 2-2. DataFrame 다루기 실습

< 실습 자료 >    
*    기업별 연봉, 채용직무, 규모를 통해 데이터프레임을 만들어보자.
    *    ※ 해당 정보는 실제와 다를 수 있습니다.
*    기업 종류 : SK텔레콤, 삼성전자, 넷마블, 카카오, 한국조폐공사
*    기업별 연봉 정보
    *    SK텔레콤     : 4,821만원
    *    삼성전자     : 4,000만원
    *    넷마블       : 3,500만원
    *    카카오       : 4,200만원
    *    한국조폐공사 : 2,862만원
*    기업별 채용직무
    *    SK텔레콤     : 서비스
    *    삼성전자     : 영업
    *    넷마블       : 디자인
    *    카카오       : IT개발
    *    한국조폐공사 : 경영사무
*    기업별 규모
    *    SK텔레콤     : 대기업
    *    삼성전자     : 대기업
    *    넷마블       : 중견기업
    *    카카오       : 중견기업
    *    한국조폐공사 : 공공기관

< 조건 >
1.    DataFrame를 만들 때, 어떤 방식을 사용해도 무관
    *    Dictionary 형식, List 형식 등 자유롭게 사용
2.    변수명은 자유롭게 정해도 괜찮으나 누구나 이해할 수 있도록 작성
    *    변수는 명사로 작성하는 것이 좋음

< 문제 >
1.    기업별 정보 DataFrame를 만드시오.
    - 행 : 0부터 정수 값
    - 열 : 기업명, 기업규모, 채용직무, 연봉정보 (열 이름과 순서 지켜주세요!!!)
2.    기업별 정보 DataFrame의 인덱스명을 아래와 같이 지정하시오.
    - SK텔레콤 : T사, 삼성전자 : S사, 넷마블 : N사, 카카오 : K사, 한국조폐공사 : H사
3.    기업별 정보 DataFrame의 컬럼 값을 아래와 같이 변경하시오.
    - 채용직무 : 직군, 기업규모 : 기업형태
4.    기업별 정보 DataFrame에서 삼성전자, 카카오, SK텔레콤의 정보만 출력하시오.
5.    기업별 정보 DataFrame에서 모든 기업의 기업명과 연봉정보만 출력하시오.
6.    기업별 정보 DataFrame에서 한국조폐공사이 정보를 삭제하시오.
7.    기업별 정보 DataFrame에 아래 기업 정보를 추가하시오.
    - 기업명 : 페이스북
    - 인덱스명 : F사
    - 기업형태 : 외국계
    - 직군 : SNS운영
    - 연봉정보 : 4,200만원
8.    기업별 정보 DataFrame에 아래 컬럼을 추가하시오.
    - 컬럼명 : 경력사항
    - 컬럼내용 :
        - SK텔레콤, 삼성전자는 신입
        - 넷마블, 페이스북은 경력
        - 카카오는 경력무관

In [ ]:
# 문제 1. 기업별 정보 DataFrame를 만드시오.
# 코드 작성
job_dict = {'기업명':['SK텔레콤', '삼성전자', '넷마블', '카카오', '한국조폐공사'],
            '기업규모':['대기업', '대기업', '중견기업', '중견기업', '공공기관'], 
            '채용직무':['서비스', '영업', '디자인', 'IT개발', '경영사무'], 
            '연봉정보':['4,821만원', '4,000만원', '3,500만원', '4,200만원', '2,862만원']}
job_df1 = pd.DataFrame(job_dict, index = [0,1,2,3,4])
job_df1

      기업명  기업규모  채용직무     연봉정보
0   SK텔레콤   대기업   서비스  4,821만원
1    삼성전자   대기업    영업  4,000만원
2     넷마블  중견기업   디자인  3,500만원
3     카카오  중견기업  IT개발  4,200만원
4  한국조폐공사  공공기관  경영사무  2,862만원

In [ ]:
# 문제 2. 기업별 정보 DataFrame의 인덱스명을 아래와 같이 지정하시오.
# 코드 작성
job_df1.rename(index = {0:'T사', 1:'S사', 2:'N사', 3:'K사', 4:'H사'}, inplace = True)
job_df1

       기업명  기업규모  채용직무     연봉정보
T사   SK텔레콤   대기업   서비스  4,821만원
S사    삼성전자   대기업    영업  4,000만원
N사     넷마블  중견기업   디자인  3,500만원
K사     카카오  중견기업  IT개발  4,200만원
H사  한국조폐공사  공공기관  경영사무  2,862만원

In [ ]:
# 문제 3. 기업별 정보 DataFrame의 컬럼 값을 아래와 같이 변경하시오.
# 코드 작성
job_df1.rename(columns = {'채용직무':'직군', '기업규모':'기업형태'}, inplace = True)
job_df1

       기업명  기업형태    직군     연봉정보
T사   SK텔레콤   대기업   서비스  4,821만원
S사    삼성전자   대기업    영업  4,000만원
N사     넷마블  중견기업   디자인  3,500만원
K사     카카오  중견기업  IT개발  4,200만원
H사  한국조폐공사  공공기관  경영사무  2,862만원

In [ ]:
# 문제 4. 기업별 정보 DataFrame에서 삼성전자, 카카오, SK텔레콤의 정보만 출력하시오.
# 코드 작성
job_df1.iloc[[1,3,0]]

      기업명  기업형태    직군     연봉정보
S사   삼성전자   대기업    영업  4,000만원
K사    카카오  중견기업  IT개발  4,200만원
T사  SK텔레콤   대기업   서비스  4,821만원

In [ ]:
# 문제 5. 기업별 정보 DataFrame에서 모든 기업의 기업명과 연봉정보만 출력하시오.
# 코드 작성
job_df1[['기업명', '연봉정보']]

       기업명     연봉정보
T사   SK텔레콤  4,821만원
S사    삼성전자  4,000만원
N사     넷마블  3,500만원
K사     카카오  4,200만원
H사  한국조폐공사  2,862만원

In [ ]:
# 문제 6. 기업별 정보 DataFrame에서 한국조폐공사의 정보를 삭제하시오.
# 코드 작성
job_df1.drop('H사', axis = 0, inplace = True)
job_df1

      기업명  기업형태    직군     연봉정보
T사  SK텔레콤   대기업   서비스  4,821만원
S사   삼성전자   대기업    영업  4,000만원
N사    넷마블  중견기업   디자인  3,500만원
K사    카카오  중견기업  IT개발  4,200만원

In [ ]:
# 문제 7. 기업별 정보 DataFrame에 아래 기업 정보를 추가하시오.
# 코드 작성
job_df1.loc['F사'] = ['페이스북', '외국계', 'SNS운영', '4,200만원']
job_df1

      기업명  기업형태     직군     연봉정보
T사  SK텔레콤   대기업    서비스  4,821만원
S사   삼성전자   대기업     영업  4,000만원
N사    넷마블  중견기업    디자인  3,500만원
K사    카카오  중견기업   IT개발  4,200만원
F사   페이스북   외국계  SNS운영  4,200만원

In [ ]:
# 문제 8. 기업별 정보 DataFrame에 아래 컬럼을 추가하시오.
# 코드 작성
job_df1['경력사항'] = ['신입', '신입', '경력', '경력무관', '경력']
job_df1

      기업명  기업형태     직군     연봉정보  경력사항
T사  SK텔레콤   대기업    서비스  4,821만원    신입
S사   삼성전자   대기업     영업  4,000만원    신입
N사    넷마블  중견기업    디자인  3,500만원    경력
K사    카카오  중견기업   IT개발  4,200만원  경력무관
F사   페이스북   외국계  SNS운영  4,200만원    경력

# STEP 3. Pandas로 데이터 다루기

* Pandas의 다양한 기능을 사용하여 데이터를 다뤄본다

< Pandas 함수 >
* 상단 5항목 보기 : 데이터프레임.head()
* 하단 5항목 보기 : 데이터프레임.tail()
* (행, 열) 크기 확인하기 : 데이터프레임.shape
* 전반적인 정보 확인하기 : 데이터프레임.info()
* 요약 통계량 확인하기 : 데이터프레임.describe()
* 정렬해서 보기 : 데이터프레임.sort_values(by=['컬럼명'])
* Null값(빈 값) 체우기 : 데이터프레임.fillna(0)
* 합계 구하기 : 데이터프레임['컬럼명'].sum()
* 평균 구하기 : 데이터프레임['컬럼명'].mean()
* 조건으로 탐색하기 : 데이터프레임[조건식]

< 실습 내용 >
* 서울시CCTV 데이터를 가지고 함수를 다양하게 적용해보세요.

In [ ]:
# 데이터 불러오기
cctv_df = pd.read_excel('seoul_cctv.xlsx')

In [ ]:
# 상단 5항목 보기
cctv_df.head()

     기관명    소계  2011년 이전  2012년  2013년  2014년  2015년  2016년  2017년  2018년
0  강 남 구  5221    1944.0  195.0  316.0    430    546    765    577    448
1  강 동 구  1879     303.0  387.0  134.0     59    144    194    273    385
2  강 북 구  1265     243.0   88.0  141.0     74    145    254      1    319
3  강 서 구  1617     219.0  155.0  118.0    230    187    190    264    254
4  관 악 구  3985     430.0   56.0  419.0    487    609    619    694    671

In [ ]:
# 하단 5항목 보기
cctv_df.tail()

        기관명    소계  2011년 이전  2012년  2013년  2014년  2015년  2016년  2017년  2018년
20    용 산 구  2063    1279.0  152.0  201.0    107    102     89     60     73
21    은 평 구  2962    1365.0   83.0   99.0    343    180    296    229    367
22    종 로 구  1471       8.0    7.0  599.0    132    195    148    281    101
23  중     구  1544      25.0  165.0  114.0     80    245    270    317    328
24    중 랑 구  1068       NaN    NaN    NaN    770    102    121     66      9

In [ ]:
# (행, 열) 크기 확인하기
cctv_df.shape

(25, 10)

In [ ]:
# 전반적인 정보 확인하기
cctv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   기관명       25 non-null     object
 1   소계        25 non-null     int64
 2   2011년 이전  23 non-null     float64
 3   2012년     23 non-null     float64
 4   2013년     23 non-null     float64
 5   2014년     25 non-null     int64
 6   2015년     25 non-null     int64
 7   2016년     25 non-null     int64
 8   2017년     25 non-null     int64
 9   2018년     25 non-null     int64
dtypes: float64(3), int64(6), object(1)
memory usage: 2.1+ KB

In [ ]:
# 요약 통계량 확인하기
cctv_df.describe()

                소계     2011년 이전       2012년  ...       2016년       2017년       2018년
count    25.000000    23.000000   23.000000  ...   25.000000   25.000000   25.000000
mean   2219.720000   580.478261  123.826087  ...  267.360000  299.440000  349.480000
std     967.646523   488.248248   81.895528  ...  160.365956  216.219618  218.601067
min     858.000000     8.000000    7.000000  ...   21.000000    1.000000    9.000000
25%    1586.000000   228.500000   83.500000  ...  155.000000  136.000000  195.000000
50%    1935.000000   481.000000  108.000000  ...  254.000000  273.000000  328.000000
75%    2775.000000   775.500000  158.000000  ...  326.000000  372.000000  448.000000
max    5221.000000  1944.000000  387.000000  ...  765.000000  933.000000  830.000000

[8 rows x 9 columns]

In [ ]:
# 정렬해서 보기 (2015년 기준 정렬)
cctv_df.sort_values(by=['2015년'])

        기관명    소계  2011년 이전  2012년  2013년  2014년  2015년  2016년  2017년  2018년
9     도 봉 구   858     197.0   66.0    8.0    185     59    155    117     71
5     광 진 구  1581     470.0   42.0   83.0     87     64     21    468    346
24    중 랑 구  1068       NaN    NaN    NaN    770    102    121     66      9
20    용 산 구  2063    1279.0  152.0  201.0    107    102     89     60     73
13     서대문구  2121     565.0  233.0  214.0    114    109    277    415    194
10     동대문구  2003       NaN    NaN    NaN   1326    111    233    136    197
11    동 작 구  1780     238.0   93.0   29.0    503    130    254    278    255
1     강 동 구  1879     303.0  387.0  134.0     59    144    194    273    385
2     강 북 구  1265     243.0   88.0  141.0     74    145    254      1    319
17    송 파 구  1586     600.0   99.0   88.0     21    166    100    116    396
18    양 천 구  2775     772.0  161.0  185.0    169    172    349    137    830
12    마 포 구  1935     585.0  108.0   69.0     70    177    359    372    195
21    은 평 구  2962    1365.0   83.0   99.0    343    180    296    229    367
3     강 서 구  1617     219.0  155.0  118.0    230    187    190    264    254
22    종 로 구  1471       8.0    7.0  599.0    132    195    148    281    101
14    서 초 구  2835    1172.0   91.0  228.0    134    215    352    247    396
23  중     구  1544      25.0  165.0  114.0     80    245    270    317    328
15    성 동 구  2679     665.0  109.0  118.0    101    258    201    933    294
6     구 로 구  3227     852.0  219.0  349.0    187    268    326    540    486
16    성 북 구  3003     779.0   84.0  304.0    241    279    388    285    643
19     영등포구  2495     132.0  121.0  206.0    217    366    289    371    793
7     금 천 구  1634      27.0   17.0  242.0    101    382    136    199    530
8     노 원 구  1906     481.0  117.0  203.0     80    461    298    110    156
0     강 남 구  5221    1944.0  195.0  316.0    430    546    765    577    448
4     관 악 구  3985     430.0   56.0  419.0    487    609    619    694    671

In [ ]:
# Null값(빈 값) 체우기
cctv_df.fillna(0, inplace = True)

In [ ]:
# 합계 구하기
cctv_df['2011년 이전'].sum()

13351.0

In [ ]:
# 평균 구하기
aver = cctv_df['2012년'].mean()
round(aver, 1)

123.8

In [ ]:
cctv_df.loc[19, '2012년'] # 영등포구, 2012년 cctv개수

121.0

In [ ]:
cctv_df.iloc[[1, 3, 20, 22, 24], 0:4]

      기관명    소계  2011년 이전  2012년
1   강 동 구  1879     303.0  387.0
3   강 서 구  1617     219.0  155.0
20  용 산 구  2063    1279.0  152.0
22  종 로 구  1471       8.0    7.0
24  중 랑 구  1068       0.0    0.0

In [ ]:
cctv_df[cctv_df['2018년'] < 200]

      기관명    소계  2011년 이전  2012년  2013년  2014년  2015년  2016년  2017년  2018년
8   노 원 구  1906     481.0  117.0  203.0     80    461    298    110    156
9   도 봉 구   858     197.0   66.0    8.0    185     59    155    117     71
10   동대문구  2003       0.0    0.0    0.0   1326    111    233    136    197
12  마 포 구  1935     585.0  108.0   69.0     70    177    359    372    195
13   서대문구  2121     565.0  233.0  214.0    114    109    277    415    194
20  용 산 구  2063    1279.0  152.0  201.0    107    102     89     60     73
22  종 로 구  1471       8.0    7.0  599.0    132    195    148    281    101
24  중 랑 구  1068       0.0    0.0    0.0    770    102    121     66      9